let a = 1;      // ค่าของ a คือ 1
let b = 2;      // ค่าของ b คือ 2
let c = a++;    // c ถูกกำหนดค่าเป็น a ก่อนเพิ่มค่า: c = 1, จากนั้น a ถูกเพิ่มค่าเป็น 2
let d = ++c;    // c ถูกเพิ่มค่าเป็น 2 ก่อนกำหนดค่าให้ d: d = 2
let e = ++d + d++ + d; // d ถูกเพิ่มค่าเป็น 3 ก่อนแล้วค่อยใช้ค่า, d ใช้ค่า 3 ก่อนแล้วค่อยเพิ่มเป็น 4, d ตอนนี้คือ 4

console.log(`a: ${a}`); // ค่าของ a คือ 2
console.log(`b: ${b}`); // ค่าของ b คือ 2
console.log(`c: ${c}`); // ค่าของ c คือ 2
console.log(`d: ${d}`); // ค่าของ d คือ 4
console.log(`e: ${e}`); // ค่าของ e คือ 10
