// ประกาศตัวแปรสำหรับเก็บชื่อจริง และกำหนดค่าเริ่มต้นเป็นชื่อจริงของผู้เรียน
let firstName = "ชื่อจริงของคุณ"; // แก้ไขเป็นชื่อจริงของคุณ

// ประกาศตัวแปรสำหรับเก็บนามสกุล และกำหนดค่าเริ่มต้นเป็นนามสกุลของผู้เรียน
let lastName = "นามสกุลของคุณ"; // แก้ไขเป็นนามสกุลของคุณ

// ประกาศตัวแปรสำหรับเก็บอายุ และกำหนดค่าเริ่มต้นเป็นอายุของผู้เรียน
let age = 27; // แก้ไขเป็นอายุของคุณ

// ประกาศตัวแปรสำหรับเก็บที่อยู่ และกำหนดค่าเริ่มต้นเป็นที่อยู่ของผู้เรียน
let address = "118 Mint Tower Banthatthong Rd."; // แก้ไขเป็นที่อยู่ของคุณ

// ใช้คำสั่ง console.log โดยให้ได้ผลลัพธ์ออกมาเป็น Full Name: John Doe, Age: 27, Address: 118 Mint Tower Banthatthong Rd.
console.log(`Full Name: ${firstName} ${lastName}, Age: ${age}, Address: ${address}`);
